{
  "timeline": [
    {
      "week": "Week 1",
      "title": "Initial Research & Planning",
      "description": "Researching smart mirror projects, setting goals, and planning the feature set."
    },
    {
      "week": "Week 2",
      "title": "Setting Up Raspberry Pi",
      "description": "Installing Raspberry Pi OS, configuring MagicMirror², and testing the basic setup."
    },
    {
      "week": "Week 3-4",
      "title": "Feature Integration and portfolio updating",
      "description": "In this week I will update my portfolio to include multiple pages."
    },
    {
      "week": "Week 5-6",
      "title": "Project timeline creation and weekly updates section to summarize actual additions",
      "description": "Update portfolio to include a project page with project timeline, weekly real-time updates, and in the future implement a framework to present my MVP."
    },
    {
      "week": "Week 7",
      "title": "Portfolio Cleanup & Early Prototype Submission",
      "description": "I will completely overhaul the portfolio to be in React/JSX/CSX with easy-to-edit JSON files rather than keeping the single HTML files with bad styling."
    }
  ],
  "weeklyUpdates": [
    {
      "week": "Week 1",
      "title": "Completed Initial Research",
      "description": "Gathered information on different smart mirror frameworks and planned project requirements.",
      "date": "01/14/2025"
    },
    {
      "week": "Week 2",
      "title": "Set Up Raspberry Pi",
      "description": "Successfully installed Raspberry Pi OS and configured the MagicMirror² framework.",
      "date": "01/21/2025"
    },
    {
      "week": "Week 3",
      "title": "Constructed portfolio",
      "description": "Made the framework and started my HTML website portfolio through GitHub.",
      "date": "01/28/2025"
    },
    {
      "week": "Week 4",
      "title": "Cleaned up portfolio",
      "description": "Made a separate research page on the portfolio to keep the research portion of the project separate.",
      "date": "02/03/2025"
    },
    {
      "week": "Week 5",
      "title": "Portfolio remodel and additional module implementation",
      "description": "Reconstructed portfolio in React architecture, making it easier to add additional pages and create a proper page system with different CSS files. Implemented more Magic Mirror modules like a date and time display with a handmade school-schedule progress bar.",
      "date": "02/10/2025"
    },
    {
      "week": "Week 6",
      "title": "Portfolio additions and further project cleanup",
      "description": "Added a project weekly-updates timeline section to the Projects page in my website, and implemented image-importing CSS with a decorative border.",
      "date": "02/17/2025"
    },
    {
      "week": "Week 7",
      "title": "Spotify support for the mirror",
      "description": "Integrated Spotify authentication; the mirror can now pair to a Bluetooth speaker and display current track info.",
      "date": "02/23/2025"
    },
    {
      "week": "Week 8",
      "title": "Updated portfolio with cleaner CSS",
      "description": "Refreshed the color palette, typography, and shadow depth; moved hard-coded content into JSON for easier updates.",
      "date": "02/27/2025"
    },
    {
      "week": "Week 9",
      "title": "Submitted MVP write-up",
      "description": "Documented our minimum-viable mirror in a formal report and pushed it to the project site.",
      "date": "03/05/2025"
    },
    {
      "week": "Week 10",
      "title": "Measured & Modeled the Enclosure",
      "description": "Used digital calipers to record exact dimensions of the monitor, Pi, and power hardware; created a tight-tolerance CAD model of the frame and back housing in Fusion 360.",
      "date": "03/12/2025"
    },
    {
      "week": "Week 11",
      "title": "Test-Print Tolerance Coupons",
      "description": "Printed small fit-check coupons to verify the caliper-derived clearances (press-fits, snap lugs, cable channels) and tweaked the CAD until each part slid smoothly with no wobble.",
      "date": "03/19/2025"
    },
    {
      "week": "Week 12",
      "title": "Sectioned & Printed Full-Size Parts",
      "description": "Split the oversized frame into four dovetailed quadrants to fit the 220 × 220 mm bed; printed all pieces in PETG, pausing mid-print for accent-color layers.",
      "date": "03/26/2025"
    },
    {
      "week": "Week 13",
      "title": "Assembled & Weight-Reduced the Frame",
      "description": "Epoxy-glued and clamped the quadrants, then reinforced seams with printed splines; added honeycomb cut-outs in non-structural zones to save about 30 % filament and 120 g of weight.",
      "date": "04/02/2025"
    },
    {
      "week": "Week 14",
      "title": "Final Finishing & Cable-Routing Holes",
      "description": "Wet-sanded seams, filled gaps with PLA putty, sprayed two coats of satin black, and drilled oval pass-throughs for USB-C/HDMI; installed heat-set inserts for removable rear panels.",
      "date": "04/09/2025"
    }
  ],
  "MVP": [
    {
      "week": "Minimum Viable Product",
      "title": "Total project completion at this point",
      "description": "The MVP is a monitor connected over HDMI to a Raspberry Pi, displaying time, weather, and a VHHS period-schedule progress bar. Spotify information works, and a Pi Camera streams video for future facial recognition.",
      "date": "03/10/2025",
      "video": "/IMG_8849.MOV"
    }
  ],
  "PostMVP": [
    {
      "title": "Post-MVP Enhancements",
      "description": "oeijdowijedojwied"
    }
  ],
  "finalPresentation": {
    "title": "Final Product Demo",
    "description": "A walkthrough of the finished smart mirror, including the 3-D-printed housing, cable management, ambient LED lighting, Spotify playback, and a facial-recognition preview.",
    "date": "04/30/2025",
    "video": "/IMG_9385.mp4"
  }
}
